package com.laba5_6_7.task1;

/**              Лабораторная работа №5
 * Вариант: 6
 * Тема:  «Разработка классов и использование их в программах»
 *
 * Задача: В первом задании необходимо произвести проектирование классов по
 * теме вашего варианта. Нужно описать:
 *  не менее 3 классов (имя класса – существительное);
 * В каждом классе реализовать:
 *  не менее 4 полей (к каждому полю соответствуют нужные
 * свойства);
 *  не менее 2 конструкторов (без параметров и со всеми
 * параметрами);
 *  не менее 3 методов.
 * Также привести по одному примеру (объекту) каждого класса.
 *
 * Вариант 6. Телекоммуникации. Аудио- и видеотехника.
 *
 * Выполнил: Волков Андрей Александрович
 * Проверил: Яковлев Андрей Валерьевич
 */

public class Main {
    public static void main(String[] something) {
        Device device = new Device();
        AudioDevice audioDevice = new AudioDevice();
        VideoDevice videoDevice = new VideoDevice();
    }
}
