package com.lab1;
/**              Лабораторная работа №1
 * Вариант: 6
 * Тема:  «Создание, компилирование, отладка и выполнение проектов в интегрированной среде разработки»
 * Задача: Необходимо вывести на экран сообщение по варианту.
 *
 * Выполнил: Волков Андрей Александрович
 * Проверил: Яковлев Андрей Валерьевич
*/
public class Body {
    public static void main(String[] args){
        String text = "Безотчетная тревога, витавшая над толпою, с особой силой\n" +
                "охватила одного из зрителей, так что он не стал дожидаться, пока\n" +
                "корабль войдет в порт; он бросился в лодку и приказал грести\n" +
                "навстречу «Фараону», с которым и поравнялся напротив бухты\n" +
                "Резерв.";
        System.out.print(text);
    }
}




