package com.laba6;

/**              Лабораторная работа №6
 * Вариант: 6
 * Тема:  «Разработка классов и использование их в программах»
 *
 * Задача: Необходимо реализовать классы из задания 1 лабораторной работы №5, и
 * в каждом классе реализовать:
 *  не менее 4 полей (к каждому полю соответствуют нужные
 * свойства);
 *  не менее 2 конструкторов (без параметров и со всеми
 * параметрами);
 *  не менее 4 методов (с возвращающим значением и без
 * возвращающего значения).
 *
 * Выполнил: Волков Андрей Александрович
 * Проверил: Яковлев Андрей Валерьевич
 *
 * Вариант 6. Телекоммуникации. Аудио- и видеотехника.
 */


public class Main {
    public static void main(String[] something) {
    }
}
