package com.laba10.task1;

/**              Лабораторная работа №10
 * Вариант: 6
 * Тема:  «Разработка программ, реализующих и использующих интерфейсы»
 *
 * Задача:  Создать и реализовать интерфейсы, также использовать
 * наследование и полиморфизм для указанных предметных областей.
 * В классе должны быть реализованы:
 *  поля (закрытые или защищѐнные), нужное количество;
 *  свойства (для каждого поля);
 *  конструкторы (не менее двух);
 *  перегруженные операции;
 *  методы (нужное количество);
 *  метод toString();
 *  статические поля, если они нужны;
 *  статические свойства (если есть статические поля).
 *
 * interface Корабль <- abstract class Военный Корабль <- class Авианосец.
 *
 * Выполнил: Волков Андрей Александрович
 * Проверил: Яковлев Андрей Валерьевич
 */

public class Main {
}
